# Постановка задачи
```
Написать программу, которая из имеющегося массива строк, формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.
```
## Пример input - output:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → []

# Список используемых функций
Для решения задачи использовались пять функций. Рассмотрим задачу, которую решает каждая из них.

## 1. Создание первоначального одномерного массива данных
```
string [] CreateArray()
```
Функция принимает на вход количество элементов массива **N**.

Функция выдает пустой массив размера **N**.

## 2. Заполнение первоначального одномерного массива данных
```
string [] FillArray(string [] array)
```
Функция принимает на вход массив строк **string [] array**

Функция выдает заполненный поэлементно массив строк **array**.

## 3. Печать элементов одномерного массива 
```
void PrintArray (string [] array)
```
Функция принимает на вход массив строк **string [] array**

Функция поэлементно печатает элементы массива **array**.

## 4. Создание нового одномерного массива
```
string [] NewArrayCreate (string [] array)
```
Функция принимает на вход массив строк **string [] array**

Функция выдает новый пустой массив **arrayNew**, с количеством элементов, равному количеству элементов первоначального массива, удовлетворяющих условию *"кол-во символов элемента не больше 3"*.

## 5. Заполнение нового одномерного массива
```
string [] FillNewArray(string [] array, string [] array2)
```
Функция принимает на вход два массива строк новый - **array** и первоначальный - **array2**

Функция заполняет новый массив **array** элементами из первоначального массива **array2** при условии, что они удовлетворяют условию *"кол-во символов элемента не больше 3"*.

# Порядок использования функций
## 1. Создание первоначального массива и его ручное заполнение пользователем
```
string [] massive = CreateArray();
FillArray(massive);
```
## 2. Печать элементов первоначального массива
```
Console.WriteLine("Ваш старый массив:");
PrintArray(massive);
```
## 3. Создание нового массива и его заполнение в соответствии с условием
```
Console.WriteLine("Ваш новый массив:");
string [] NewMassive = NewArrayCreate(massive);
```
## 4. Печать элементов нового массива
```
FillNewArray(NewMassive,massive);
PrintArray(NewMassive);
```